//01 Вывести квадрат числа

Console.Write("Введите число : ");
int a = Convert.ToInt32(Console.ReadLine());


a = a * a;
Console.Write("Квадрат числа = "+ a);